# Plant_CreateDupPlant

## Description
Creates a new plant from the currently selected plant

```pascal
PROCEDURE Plant_CreateDupPlant(plantToCreateFrom : HANDLE);
```

```python

def vs.Plant_CreateDupPlant(plantToCreateFrom):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|plantToCreateFrom|HANDLE||

## Version
Availability: from Vectorworks 2014
## Category
* PlantObjectCoreTools